---
type: FilledRegion
namespace: Autodesk.Revit.DB
version: 2024
members: 9
tags: [revit-api, class]
---

# FilledRegion

`Autodesk.Revit.DB.FilledRegion` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | — | `` |
| Method | CreateMaskingRegion | — | `` |
| Method | GetBoundaries | 2013 | `public IList < CurveLoop > GetBoundaries ()` |
| Method | GetValidLineStyleIdsForFilledRegion | 2013 | `public static IList < ElementId > GetValidLineStyleIdsForFilledRegion ( Document document )` |
| Method | IsValidFilledRegionTypeId | 2013 | `public static bool IsValidFilledRegionTypeId ( Document document , ElementId typeId )` |
| Method | IsValidLineStyleIdForFilledRegion | 2013 | `public static bool IsValidLineStyleIdForFilledRegion ( Document document , ElementId lineStyleId )` |
| Method | SetLineStyleId | 2013 | `public void SetLineStyleId ( ElementId lineStyleId )` |
| Property | IsMasking | 2012 | `public bool IsMasking { get ; }` |
| Property | Parameter | — | `` |